[
  {
    "id": "9084986f-456c-449b-ae6e-59ef1f26b129",
    "title": {
      "kk": "Алмаc қылыш",
      "ru": "Алмазный меч",
      "en": "Diamond Sword"
    },
    "author": {
      "kk": "Ільяс Есенберлин",
      "ru": "Ильяс Есенберлин",
      "en": "Ilyas Yesenberlin"
    },
    "genre": {
      "kk": "Тарихи проза",
      "ru": "Историческая проза",
      "en": "Historical Prose"
    },
    "rating": 5,
    "totalCopies": 20,
    "availableCopies": 10,
    "description": {
      "kk": "Алмас қылыш» романы Ілияс Есенберлиннің «Көшпенділер» тарихи трилогиясының бірінші бөлімі болып табылады. Кітапта Қазақ хандығының құрылуы, Керей мен Жәнібектің тәуелсіздік үшін күресі, сыртқы жауларға қарсы тұруы және мемлекеттің қалыптасуы туралы баяндалады",
      "ru": "Роман 'Алмазный меч' (Алмас қылыш) является первой частью исторической трилогии 'Кочевники' Ільяса Есенберлина. В книге рассказывается о создании Казахского ханства, борьбе Керея и Жәнібека за независимость, противостоянии с внешними врагами и становлении государства.",
      "en": "The novel 'Diamond Sword' (Алмас қылыш) is the first part of the historical trilogy 'Nomads' by Ilyas Yesenberlin. The book tells about the creation of the Kazakh Khanate, the struggle of Kerey and Zhanibek for independence, resistance to external enemies, and the formation of the state."
    },
    "coverColor": "#0d2d48",
    "coverUrl": "https://static.insales-cdn.com/r/Jo9mxYj74AM/rs:fit:1000:1000:1/plain/images/products/1/6839/426465975/1999304_550.jpg@jpg",
    "videoUrl": "https://www.youtube.com/watch?v=Hmq6brVcD-c",
    "summary": {
      "kk": "Роман 'Алмас қылыш' XV ғасырда Қазақ хандығының құрылуы туралы баяндайды. Керей мен Жәнібек Абулхаирдың билігінен кетіп, тәуелсіз мемлекеттің негізін қалайды. Кітапта олардың шайқастары, дипломатиялық қадамдары және қазақ тайпаларын біріктірудегі алғашқы қадамдары сипатталады.",
      "ru": "Роман 'Острый меч' (Алмазный меч) повествует о создании Казахского ханства в XV веке. Керей и Жәнібек уходят из-под власти Абулхаира и закладывают основу независимого государства. В книге описываются их сражения, дипломатические ходы и первые шаги к объединению казахских племен.",
      "en": "The novel 'Diamond Sword' (Алмас қылыш) narrates the creation of the Kazakh Khanate in the 15th century. Kerey and Zhanibek leave the rule of Abulkhair and lay the foundation for an independent state. The book describes their battles, diplomatic moves, and first steps towards uniting the Kazakh tribes."
    }
  }
]
